use proconio::input;

fn main() {
    input! {
        n: usize,
        m: [(f32, f32); n]
    }

    let mut ans = vec![0; 6];

    for (h, c) in m {
        // 猛暑日：最高気温が 35度以上の日
        if h >= 35.0 { ans[0] += 1 }
        // 真夏日：最高気温が 30度以上、35度未満の日
        if 35.0 > h && h >= 30.0 { ans [1] += 1 }
        // 夏日　：最高気温が 25度以上、30度未満の日
        if 30.0 > h && h >= 25.0 { ans [2] += 1 }
        // 熱帯夜：最低気温が 25度以上の日
        if c >= 25.0 { ans[3] += 1 }
        // 冬日　：最低気温が 0度未満で、最高気温が 0度以上の日
        if h >= 0.0 && c < 0.0 { ans[4] += 1 }
        // 真冬日：最高気温が 0度未満の日
        if h < 0.0 { ans[5] += 1 }
    }

    for i in 0..5 {
        print!("{} ", ans[i]);
    }
    println!("{}", ans[5]);
}